Revit 2027 API
MultiReferenceAnnotationOptions.GetAdditionalReferencesToDimension Method
 Gets the additional references which the dimension will witness.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<Reference> GetAdditionalReferencesToDimension()
Public Function GetAdditionalReferencesToDimension As IList(Of Reference)
public:
IList<Reference^>^ GetAdditionalReferencesToDimension()
member GetAdditionalReferencesToDimension : unit -> IList<Reference>
Return Value
IList<Reference>
 The additional references which the dimension will witness.
Remarks
 These references may be to elements of other categories than the reference category returned by MultiReferenceAnnotationType.
See Also
Reference
MultiReferenceAnnotationOptions Class
Autodesk.Revit.DB Namespace